Revit 2026 API

# HardwoodHardwoodApplication Property

---

The property labeled "Used For" from the "Hardwood" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string HardwoodApplication { get; }
```
```vb
Public Shared ReadOnly Property HardwoodApplication As String
	Get
```
```cpp
public:
static property String^ HardwoodApplication {
	String^ get ();
}
```
```fsharp
static member HardwoodApplication : string with get
```

#### Property Value

String

This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "HardwoodApplicationType".

#### Reference

Hardwood Class

Autodesk.Revit.DB.Visual Namespace